// Шаблоны предложений ---------------------------------------------------------
let sentence1 = [
    'ПРИЛ СУЩ1 ВВОД ГЛАГ СУЩ2 УТВЕРЖД',
    {
        'ПРИЛ': { шаблон: 'ПРИЛ', шанс: 1/3, род: 'СУЩ1' },
        'СУЩ1': { шаблон: 'СУЩ' },
        'ВВОД': { шаблон: ', ВВОД, ', шанс: 1/3, },
        'ГЛАГ': { шаблоны: ['ГЛАГ', ', ДЕЕПРИЧ, ГЛАГ', 'ГЛАГ и ГЛАГ'] },
        'СУЩ2': { шаблон: 'СУЩ', падеж: 'дательный' },
        'УТВЕРЖД': { шаблон: 'УТВЕРЖД', шанс: 1/15 }
    }
]

let sentence2 = [
    'ВВОД ПРИЛ СУЩ1 ГЛАГ СУЩ2 УТВЕРЖД',
    Object.assign({},
        sentence1[1],
        { 'ВВОД': { шаблоны: ['НАЧ_ВВОД', 'ВВОД, '], шанс: 1/3 } }
    )
]

let sentence3 = [
    'ВВОД ПРИЛ СУЩ КРАТК_ПРИЛ',
    {
        'ВВОД': { шаблоны: [ 'Но', 'ВВОД' ], шанс: 1/10 },
        'ПРИЛ': { шаблон: 'ПРИЛ', шанс: 1/2, род: 'СУЩ' },
        'СУЩ': { шаблон: 'СУЩ' },
        'КРАТК_ПРИЛ': { шаблон: 'КРАТК_ПРИЛ', род: 'СУЩ' }
    }
]

// Экспорт ---------------------------------------------------------------------
module.exports = [ sentence1, sentence2, sentence3 ]
