/**
 * Вводные слова и вводные фразы, которые могут использоваться только
 * в начале предложения
 */
export default [
    'можно предположить, что',
    'из вышесказанного следует, что',
    'известный факт, что',
    'не секрет, что',
    'в цивилизованном обществе принято считать, что',
    'представляется логичным, что',
    'главное, что',
    'само собой разумеется, что',
    'разумеется, что',
    'не подлежит сомнению, что',
    'общеизвестно, что',
    'как ни странно, но',
    'весьма интересно, что'
]
