/**
 * Прилагательные в мужском роде, в единственном числе
 */
export default [
  'комплексный',
  'несложный',
  'амбивалентный',
  'эквивалентный',
  'глубокий',
  'бесконечный',
  'ленейно зависимый',
  'изолированный',
  'косвенный',
  'аксиоматичный',
  'ориентированный',
  'криволинейный',
  'отрицательный',
  'положительный',
  'иррациональный',
  'постоянный',
  'тригонометрический',
  'равновероятный',
  'производный',
  'наименьший',
  'наибольший',
  'степенной',
  'линейный',
  'конечный',
]
