/**
 * Сокращения свойств существительных
 * Да, переменные русскими буквами ¯\_(ツ)_/¯
 */
const [м, ж, с] = [
  { род: 'м' },
  { род: 'ж' },
  { род: 'с' },
]

/**
 * Существительные с указанием рода в свойствах
 */
export default [
  ['распределение', с],
  ['контрпример', м],
  ['произведение', с],
  ['предел', м],
  ['функция', ж],
  ['верктор', м],
  ['приближение', с],
  ['произведение', с],
  ['интеграл', м],
  ['функциональный скачок', м],
  ['множество', с],
  ['поле', с],
  ['равенство', с],
  ['неравенство', с],
  ['неравенство', с],
  ['статистика', ж],
  ['постулат', ж],
  ['теория категорий', ж],
  ['минус бесконечность', ж],
  ['бесконечность', ж],
  ['многочлен', ж],
  ['метод', ж],
  ['умножение двух векторов (скалярное)', с],
  ['лента Мёбиуса', ж],
  ['отрезок [ a, b ]', м],
  ['функция y = f ( x )', ж],
  ['целочисленность', ж],
  ['целое число', ж],
  ['натуральное число', ж],
  ['простое число', ж],
  ['дробь', ж],
  ['математический анализ', м],
  ['начало координат', с],
  ['логарифм', м],
  ['натуральный логарифм', м],
  ['тройной интеграл', м],
  ['последовательность Фибоначчи', ж],
  ['нормальный ряд Тейлора', м],
  ['неравенство Бернулли', м],
  ['исперсия', м],
  ['функциональный анализ', м],
  ['неопределённость типа 0 / 0', ж],
]
